#include "stm32f446xx.h"

void SystemInit(void) {}
void _init(void) {}

void toggle_led(void) {
    if(EXTI->PR & (1 << 13)) {
        GPIOA->ODR ^= (1 << 5);

        // фильтр дребезга
        for (volatile int i = 0; i < 150000; i++) {}

        EXTI->PR = (1 << 13);
    }
}

int main(void) {
    // 1. ТАКТИРОВАНИЕ: Включаем Порт А, Порт С и модуль системной конфигурации SYSCFG
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN | RCC_AHB1ENR_GPIOCEN;
    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN; // Компилятор сам подставит нужный правильный бит!


    // 2. Настраиваем светодиод РА5 на Выход (Output) 
    GPIOA->MODER &= ~(3 << (5 * 2));
    GPIOA->MODER |= (1 << (5 * 2));

    // 3. Настраиваем ножку кнопки РС13 на вход (биты 00) - очищаем биты 27 и 26 (13 * 2 = 26)
    GPIOC->MODER &= ~(3 << (13 * 2));

    /// 4. МУЛЬТИПЛЕКСОР: Привязываем 13-ю линию EXTI к Порту C (кнопка)
    // В структурах ST регистры EXTICR представлены в виде массива из 4 элементов
    // Линия 13 попадает в EXTICR[3] (это четвертый регистр, так как нумерация с 0)
    SYSCFG->EXTICR[3] &= ~(0xF << 4); // Очищаем 4 бита
    SYSCFG->EXTICR[3] |= (0x2 << 4); // 2 означает GPIO Порт C
    
    // 5. Настраиваем EXTI для 13-й линии
    EXTI->IMR |= (1 << 13); // Разрешаем прерывание по 13-й линии (Unmask)
    EXTI->FTSR |= (1 << 13); // Включаем триггер на падающий фронт (нажатие кнопки)

    // 6. NVIC: Разрешаем прерывание EXTI15_10 в ядре ARM Cortex-M4
    // Используем официальный номер прерывания EXTI15_10_IRQn
    NVIC_EnableIRQ(EXTI15_10_IRQn);

    // Включаем светодиод изначально, чтобы проверить, что прерывание его погасит
    GPIOA->ODR &= ~(1 << 5);

    // 7. Настоящий хардкорный спящий цикл
    
    while (1) {
//        __wfi;
    }

    return 0;
    
}

// Шаг 8: написание функции-обработчика прерывания
// Имя функции должно быть строго таким, потому что оно зашито в ассемблерном стартапе!
void EXTI15_10_IRQHandler(void) {
    toggle_led();    
}